<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
        
  <meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
  <title>Jbuilder for newbies</title>
  
</head>
<body bgcolor="#ffffff">
<div align="Center"><font color="#ff0000"><u><b><big><big><font size="4">Comment 
  d&eacute;buter avec JBuilder 3.5 ?</font><br>
<br>
</big></big></b></u></font>
<div align="Left">Ce document a pour but de vous aider &agrave; prendre en
main un des meilleurs IDE Java: JBuilder 3.5. Vous devez lire la suite si
les IDE (environnements de d&eacute;veloppement int&eacute;gr&eacute;s) ne
vous sont pas familiers, ou si vous d&eacute;butez avec JBuilder.<br>
Nous allons vous pr&eacute;senter l'interface graphique, et cr&eacute;erun
petit programme pour vous montrer comment se servir d'une des fonctionsles
plus abouties: la cr&eacute;ation automatis&eacute;e d'interfaces utilisateur.<br>
<br>
NOTE: ce document contient 11 images, il peut &ecirc;tre assez long &agrave;
charger.<br>
<hr align="Left" width="100%" size="2"><font color="#ff0000">ENVIRONNEMENT
JBuilder "au repos"<br>
<br>
</font><img src="http://www.jgflsoft.com/faq/jbuilder.jpg" alt="Jbuilder au repos" width="819" height="578"><br>
<br>
<font color="#ff0000"><big><big><big>1</big></big></big><font color="#000000">
- Il s'agit de la zone o&ugrave; est pr&eacute;sent&eacute;, en temps normal,
le code source du fichier ouvert. On peut profiter de divers fonctions concernant
cette vue telles que la colorisation automatique du code, l'auto-indentation,
une ligne verticale qui d&eacute;finit la zone imprimable, etc...<br>
Chaque fichier ouvert vient cr&eacute;er un nouvel onglet et s'affiche dans
cette zone. Il n'y a ici qu'un seul fichier ouvert: MainFrame.java<br>
<br>
<font color="#ff0000"><big><big><big><big>2 <small><font color="#000000"><small><small>
- Il s'agit d'une zone (une JList) o&ugrave; sont affich&eacute;s les fichiers
du projet en cours. On peut voir ici 4 types de fichiers: le fichier central
qui "regroupe" tous les fichiers du projet (c'est le fichier "projet") &agrave;
l'extension .jpr, les fichiers Java source .java, les images .jpg et un fichier
JavaDoc .html. Pour ouvrir un de ces fichiers, il suffit de cliquer dessus.
</small></small></font></small></big></big></big></big></font></font></font><br>
<br>
<font color="#ff0000"><big><big><big>3 <font color="#000000"><small><small><small>
- Cette zone concerne le fichier ouvert. Elle affiche ici les imports, les
variables, m&eacute;thodes,&nbsp; et constructeurs de la classe en cours,
car on est en mode "source" (voir 5). Si l'on &eacute;tait en mode "conception",
dans cette zone serait affich&eacute;es des informations relatives &agrave;
la conception d'une GUI.<br>
<br>
<font color="#ff0000"><big><big><big><big>4</big></big></big></big></font>
 - Cette zone se retrouve dans pratiquement tous les logiciels: une barre
de menus, une barre d'ic&ocirc;nes. Vous utiliserez le plus souvent l'ic&ocirc;ne
qui repr&eacute;sente une fl&egrave;che verte, en dessous du menu "Outils"
et qui permet de compiler et de lancer un programme. Il faut aussi pr&eacute;ciser
que le menu Aide sera utile car il donne acc&egrave;s &agrave; la documentation
du JDK de Sun ainsi qu'&agrave; la documentation des API et des outils Borland.<br>
<br>
<big><big><big><font color="#ff0000">5</font></big></big></big> - Vous pouvez
toujours acc&eacute;der &agrave; l'onglet "Source" qui montre, comme ici,
le code source de la classe en cours. Si cette classe permet une conception
graphique (si elle &eacute;tend de JFrame, JWindow, JInternalFrame, etc...),
vous pourrez cliquer sur l'onglet "Conception" et lancer le concepteur graphique
de JBuilder. L'onglet "Bean" permet de cr&eacute;er des Java Beans (composants
r&eacute;utilisables) et l'onglet "Doc" permet de cr&eacute;er des JavaDoc.<br>
</small></small></small></font></big></big></big></font>
<hr align="Left" width="100%" size="2"><br>
<u><font color="#ff0000">JBuilder en action!<br>
<br>
</font></u><font color="#000000">Nous allons</font><font color="#000000">
 cr&eacute;er un </font><font color="#ff0000"><font color="#000000">petit
programma avec une interface graphique &agrave; l'aide des assistants deJBuilder.
Nous allons vous guider dans les &eacute;tapes. Connen&ccedil;ons:<br>
<br>
1- Lancez JBuilder<br>
2- Cliquez sur le menu FICHIER -&gt; NOUVEAU PROJET<br>
la fen&ecirc;tre suivante s'ouvre:<br>
<img src="http://www.jgflsoft.com/faq/jbuilder2.jpg" alt="nouveau projet jbuilder" width="502" height="405" align="Top"><br>
Saisissez dans la zone "Fichier Projet" le chemin et le nom du fichier projet
portant l'extension .jpr. Une fois fait, cliquez sur TERMINER.<br>
<br>
2- Nous avons cr&eacute;&eacute; un projet, nous devons maintenant ajouter
des classes. Nous avons choisi de cr&eacute;er une application graphique(JBuilder
permet en outre de cr&eacute;er avec des assistants de servlets,des applets,
des EJB, etc...). Cliquez sur le menu FICHIER -&gt; NOUVEAUou faites CRTL+N.<br>
La fen&ecirc;tre souvante s'ouvre:<br>
<img src="http://www.jgflsoft.com/faq/jbuilder3.jpg" alt="nouveau document" width="406" height="445"><br>
Cliquez sur "Application" puis sur le bouton "OK" pour lancer l'assistant
de cr&eacute;ation d'applications.<br>
<br>
Une seconde fen&ecirc;tre s'ouvre:<br>
<img src="http://www.jgflsoft.com/faq/jbuilder4.jpg" alt="nouvelle application (1)" width="502" height="405"><br>
Le "Paquet" est plus connu sous le nom anglais de "package". En fait, quand
dans vo programmes vous &eacute;crivez des instruction d'importation du style
"import java.io.*;", vous importez toutes les classes de ce paquet. De m&ecirc;me
si vous voulez lancer votre programme cela devra se faire, dans notre cas,
par l'instruction "<b>java sans_titre1.Application1</b>". La "classe" &eacute;tant
la classe principale du programme, celle contenant la m&eacute;thode main(),
celle qu'il faut invoquer pour lancer le programme. Dans la plupart des cas,
vous n'aurez pas &agrave; modifier le code de cette classe.<br>
Cliquez sur "Suivant &gt;".<br>
Vous acc&eacute;dez &agrave; cette fen&ecirc;tre:<br>
<img src="http://www.jgflsoft.com/faq/jbuilder5.jpg" alt="nouvelle application (2)" width="502" height="405"><br>
La classe &agrave; laquelle l'on fait ici r&eacute;f&eacute;rence est laclasse
qui d&eacute;finira le cadre principal de l'interface utilisateur.Elle &eacute;tend
de JFrame. Elle sera automatiquement lanc&eacute;e au d&eacute;marrageduprogramme
(le code pour &ccedil;a est &eacute;crit automatiquement).<br>
Par d&eacute;faut les 3 cases que vous voyez coch&eacute;es ici ne le sont
pas, cochez-les pour ce tutoriel.<br>
Cliquez sur "TERMINER".<br>
<br>
Vous aboutissez &agrave; un &eacute;cran similaire &agrave; celui de la premi&egrave;re
capture d'&eacute;cran. Le fichier ouvert est "Cadre1.java".<br>
<br>
3 - Nous allons cr&eacute;er l'interface. Cliquez sur l'onglet "Conception".
Le concepteur met quelques secondes &agrave; se lancer, puis une fen&ecirc;tre
comme ceci appara&icirc;t:<br>
<img src="http://www.jgflsoft.com/faq/jbuilder6.jpg" alt="concepteur de jbuilder" width="819" height="578"><br>
</font><big><big><big>1</big></big></big></font> - Cette zone est une simulation
de ce &agrave; quoi ressemblera votre fen&ecirc;tre. Vous y ajouterez des
composants gaphiques (2) par Drag&amp;Drop. Vous pourrez d&eacute;placer,
redimentionner, etc ces composants directement an cliquant dessus.<br>
ASTUCE: on y pense rarement, mais le bouton droit de la souris est tr&egrave;s
utile... essayez vous verrez comme les options propos&eacute;es dans le menu
qui surgit sont utiles !<br>
<br>
<font color="#ff0000"><big><big><big>2</big></big></big></font> - Vous pouvez
cliquer sur un des composants de ce panneau, le curseur se transformera en
une croix. Cliquez avec cette croix dans la zone (<font color="#ff0000">1<font color="#000000">
)</font></font>pour d&eacute;poser le composant. Les composants sont r&eacute;pertori&eacute;s
dans diff&eacute;rents onglets, vous trouverez dans Swing les principauxcomposants
graphiques de Swing, dans Conteneurs Swing des JTabbedPane, JSplitPaneetd'autres
gestionnaires de mise en page. DbSwing regroupe des composantsBorland(tr&egrave;s
utiles pour les bases de donn&eacute;es notamment).<br>
<br>
<big><big><big><font color="#ff0000">3</font></big></big></big> - Ici sont
affich&eacute;es les propri&eacute;t&eacute;s du composant graphique s&eacute;lectionn&eacute;.
La fen&ecirc;tre elle m&ecirc;me &eacute;tant s&eacute;lectionn&eacute;e,
on voit ici ses propri&eacute;t&eacute;s. Si on clique sur l'onglet "Evenements",
on a acc&egrave;s &agrave; tous les gestionnaires d'&eacute;v&egrave;mements
accessibles pour le composant s&eacute;lectionn&eacute;.<br>
<br>
<big><big><big><font color="#ff0000">4</font></big></big></big> - Comme expliqu&eacute;
auparavant, les composants de l'interface -leur nom- sont affich&eacute;s
ici. On voit que "this" est s&eacute;lectionn&eacute;, c-&agrave;-d le fen&ecirc;tre
elle-m&ecirc;me. Cette vue est tr&egrave;s pratique pour savoir d'un coup
d'oeil quels est le gestionnaire de mise en page d'un conteneur, quels composants
il contient, etc...<br>
<br>
4 - Cliquez sur l'onglet <b>Conteneurs Swing</b>, et s&eacute;lectionnezle
composant <b>javax.swing.JPanel</b> (le premier que nous d&eacute;signerons
sous le nom de JPanel), d&eacute;posez-le au centre de <b>this</b>(le cadre
gris de la capture d'&eacute;cran ci-dessus).<br>
Normalement le composant doit s'afficher (cela se mat&eacute;rialise parle
fait que la fen&ecirc;tre devient l&eacute;g&egrave;rement plus claire).Une
entr&eacute;e <b>jPanel1</b> est ajout&eacute;e &agrave; la zone (4).Cliquez
sur cette entr&eacute;e. Les propri&eacute;t&eacute;s de la zone(3) changent.
Cliquez sur la propri&eacute;t&eacute; <b>layout</b> de mani&egrave;re&agrave;
faire appara&icirc;tre une menu d&eacute;roulant regroupant lesgestionnaires
de mise en page disponibles. S&eacute;lectionnez <b>BorderLayout</b>. Revenez
&agrave; l'onglet <b>Swing</b> de la zone (2), cliquez ur le composant<b>
JButton</b> et d&eacute;posez-le <i>vers le bas</i> du jPanel1. Le boutton
s'affiche automatiquement, remplissant la partie inf&eacute;rieure de lafen&ecirc;tre.
Recommensez la m&ecirc;me op&eacute;ration en d&eacute;posantun composant
<b>JTextArea</b><i>au milieu</i> de la fen&ecirc;tre.<br>
<br>
5 - Nous avous cr&eacute;&eacute; l'interface, nous allons peaufiner tout
&agrave;a pour faciliter l'&eacute;criture du code. Dans le concepteur, s&eacute;lectionnez
le bouton en cliquant (1 seule fois !) dessus. Dans ses propi&eacute;t&eacute;s,
changez:<br>
<b>name</b>: inscrivez "button"<br>
<b>text</b>: effacez ce qui est &eacute;crit et ne mettez: "Cliquez ici !".<br>
Faites de m&ecirc;me avec la zone de texte:<br>
<b>name</b>: inscrivez "textArea"<br>
<b>text</b>: effacez ce qui est inscrit<br>
<b>lineWrap</b>: mettez la propri&eacute;t&eacute; &agrave; TRUE<br>
<br>
Ce que vous obtenez devrait ressembler &agrave; ceci:<br>
    <img src="http://www.jgflsoft.com/faq/jbuilder7.jpg" alt="conception termin&eacute;e !" width="819" height="578"><br>
<br>
6 - Nous avons termin&eacute; la partie conception et nous pouvons passer
&agrave; l'&eacute;tape &eacute;criture du code.<br>
Nous allons assigner des gestionnaires d'&eacute;v&egrave;nement (en fait
un seul au composant "button").<br>
<br>
Pour assigner un gestionnaire d'&eacute;v&egrave;nement &agrave; un composant,
il y a une seule m&eacute;thode, par l'onglet "Ev&eacute;nements" de la zone
(3) du concepteur. Cependant, pour le composant JButton, il existe une autre
m&eacute;thode (qui ne permet que d'assigner un gestionnaire OnClick d'ailleurs),
c'est de double-cliquer tout simplement sur le bouton. <br>
Nous allons essayer ici le 1&deg; m&eacute;thode dans le mesure o&ugrave;
elle sera utilis&eacute;e dans le majorit&eacute; des cas.<br>
<br>
Cliquez donc sur l'onglet "Ev&eacute;nements", voici &agrave; quoi il ressemble:<br>
    <div align="Center"><img src="http://www.jgflsoft.com/faq/jbuilder8.jpg" alt="gestionnaire d&apos;&eacute;v&egrave;nements" width="233" height="516"><br>
<div align="Justify">La premi&egrave;re fois que vous le lancez, la case&agrave;
droite de "mouseClicked" est identique aux autres cases, c-&agrave;-d,vide.
Nous vous la montrons ici une fois que vous aurez accompli l'actionsuivante:
double cliquer dessus. Allez-y, double-cliquez. JBuilder repasseen mode "Source"
et quitte le concepteur. Le curseur se trouve au milieude la m&eacute;thode
gestionnaire d'&eacute;v&egrave;nement mouseClickeddu bouton. Completez cette
m&eacute;thode avec le code visible ci-dessous:<br>
<img src="http://www.jgflsoft.com/faq/jbuilder9.jpg" alt="code &agrave; entrer" width="601" height="109"><br>
<br>
REMARQUE: une des fonction les plus utiles de JBuilder est d'afficher unpetit
menu d&eacute;roulant au fur et &agrave; mesure de l'&eacute;crituredu code
qui montre les m&eacute;thodes disponibles pour telle ou telle classe.Par
exemple, vous tapez ici "textArea" puis quand vous tapez le ".", le menuappara&icirc;t
(attendez quelques secondes car si vous tapez la suite ducode tout de suite
il n'appara&icirc;t pas), affichant toutes les m&eacute;thodesde JTextArea,
quand vous continuez &agrave; taper "set...", le menu affichetoutes les m&eacute;thodes
commen&ccedil;ant pas "set", et ainsi de suite.<br>
Vous comprendrez &agrave; quel point ce composant est utile quand vous aurez
anvie d'appeler une m&eacute;thode dont vous savez qu'elle existe amis dont
vous ne connaissez par exactement la syntaxe. Ceci arrive constamment, et
le menu d&eacute;roulant permet d'&eacute;viter des erreurs &agrave; la compilation.<br>
Cependant -eh oui il faut bien un "mais" - j'ai constat&eacute; sur mon syst&egrave;me
que ce menu ne fonctionnait pas sous Linux, je ne sais pas si c'est d&ucirc;
&agrave; un param&eacute;trage qu'il faut faire manuellement, et en plus,
du moins je n'ai rien trouv&eacute; concernant ce sujet dans la doc... en
esp&eacute;rant que ce soit juste un bug chez moi et pas pour tous les linux...
(en tout cas sous Windows, &ccedil;a fontionne ! :))<br>
<br>
7 - Nous avons termin&eacute; le programme, cliquez sur la fl&egrave;che(le
triangle vert) verte ou appuyez sur F9, le code se compile, et le programme
se lance, cliquez sur notre bouton (dans la nouvelle fen&ecirc;tre qui vient
d'appara&icirc;tre au bout de quelques secondes, et qui n'est autre que la
fen&ecirc;tre que nous achevons de concevoir) pour tester le programme, voici
ce que &ccedil;a donne:<br>
<img src="http://www.jgflsoft.com/faq/jbuilder10.jpg" alt="notre programme (1)" width="408" height="326"><img src="http://www.jgflsoft.com/faq/jbuilder11.jpg" alt="notre programme (2)" width="408" height="326"><br>
</div>
</div>
Avant d'avoir cliqu&eacute; et ... &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;
&nbsp; &nbsp; &nbsp; ... apr&egrave;s avoit cliqu&eacute;<br>
 &nbsp;&nbsp; <br>
Vous avez remarqu&eacute; que JBuilder a automatiquement ajout&eacute; une
menu FICHIER -&gt; QUITTER et un menu AIDE -&gt; A PROPOS. Ces 2 menus sont
fonctionnels, le code a &eacute;t&eacute; g&eacute;n&eacute;r&eacute; automatiquement.
Cela est d&ucirc; au fait que nous avions coch&eacute; les cases "Cr&eacute;er
une barre de menus" et "Cr&eacute;er une bo&icirc;te de dialogue A Propos"
&agrave; l'&eacute;tape de d&eacute;finition de notre projet.<br>
<br>
Je ne saurais trop vous conseiller de vous entrainer un peu &agrave; mdifier
l'interface, en examinant par exemple le gestionnaire d'&eacute;v&egrave;nements
du menu, en modifiant la conception graphique de la classe qui repr&eacute;sente
la bo&icirc;te A Propos (Cadre1_AboutBox.java par d&eacute;faut).<br>
<br>
Voil&agrave;, c'est termin&eacute; :)<br>
Comme morale &agrave; ce tutoriel (oui, oui, ce tutoriel est une vraie fable
:) retenez que ce n'est pas parce qu'on utilise JBuilder ou un IDE que l'on
doit se contenter de lui laisser tout faire. Personellement, je ne l'utilise
pas beaucoup pour ses codes pr&eacute;-&eacute;crits, et beaucoups de programmeurs
&agrave; mon instar n'aiment pas trop &ccedil;a, ils utilisent des IDE pour
la conception graphique qui se r&eacute;v&egrave;le plus simple et plus rapide.
et pour les gros projets, un Emacs n'est pas mal non plus...<br>
<br>
<hr align="Left" width="100%" size="2"><br>
    Tutoriel distribu&eacute; pour le FAQ Java de Java-France <a href="http://www.java-france.com" target="_new">www.java-france.com</a>
    <a href="http://www.jgflsoft.com"> / www.jgflsoft.com</a><br>
Pour toute information sur cet article, &eacute;crire &agrave;<a href="mailto:narcanes@online.fr">
 narcanes@online.fr</a><br>
Ecrit &agrave; Montpellier le 15 mars 2001<br>
<br>
<br>
</div>
</div>
</body>
</html>
